app/controllers/admin/users_controller.rb

  def index
    @studentnomentors = Student.joins(:user).where("mentor_id is NULL AND approval = 1").page(params[:page]).per(50).order(:personal_first_name)
    @studentsall  = Student.joins(:user).where("approval = ?", 1).page(params[:page]).per(50).order(:personal_first_name)
    @mentornostudents = Mentor.joins(:user).joins("LEFT OUTER JOIN 'students' ON students.mentor_id = mentors.id").where("students.mentor_id is NULL AND approval = 1").page(params[:page]).per(50).order(:personal_first_name)
---
SELECT "students".* FROM "students" INNER JOIN "users" ON "users"."id" = "students"."user_id" WHERE (mentor_id is NULL AND approval = 1) ORDER BY personal_first_name LIMIT 50 OFFSET 0
SELECT "mentors".* FROM "mentors" INNER JOIN "users" ON "users"."id" = "mentors"."user_id" LEFT OUTER JOIN 'students' ON students.mentor_id = mentors.id WHERE (students.mentor_id is NULL AND approval = 1) ORDER BY personal_first_name LIMIT 50 OFFSET 0