app/views/mentorships/_form.html.erb

    <%= f.label :student_id %><br />
    <%= f.collection_select :student_id, Student.order(:name), :id, :name, include_blank: true %>
---
SELECT "students".* FROM "students" ORDER BY name

    <%= f.label :mentor_id %><br />
    <%= f.collection_select :mentor_id, Mentor.order(:name), :id, :name, include_blank: true %>
---
SELECT "mentors".* FROM "mentors" ORDER BY name