app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    @camps = Camp.all

SELECT "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @camp = Camp.find(params[:id])

INSERT INTO "camps" ("created_at", "description", "student_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Dec 2013 03:51:26 UTC +00:00], ["description", "Python Dec"], ["student_id", nil], ["updated_at", Tue, 03 Dec 2013 03:51:26 UTC +00:00]]
---
  def create
    @camp = Camp.new(params[:camp])

    respond_to do |format|
      if @camp.save