app/controllers/linkedin_controller.rb

  def index
    unless LinkedinOauthSetting.find_by_user_id(current_user.id).nil?
---
SELECT "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = 1 LIMIT 1

  def oauth_account
    client = LinkedIn::Client.new('75z7i5v6pxpm37', 'Wj81lKgolV0SEJuK', @@config)
    pin = params[:oauth_verifier]
    if pin
      atoken, asecret = client.authorize_from_request(session[:rtoken], session[:rsecret], pin)
      LinkedinOauthSetting.create!(:asecret => asecret, :atoken => atoken, :user_id => current_user.id)
---
INSERT INTO "linkedin_oauth_settings" ("asecret", "atoken", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def generate_linkedin_oauth_url
    if LinkedinOauthSetting.find_by_user_id(current_user.id).nil?
---
SELECT "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = 1 LIMIT 1