app/controllers/mentorships_controller.rb

  def index
    @mentorships = Mentorship.includes(:student, :mentor)
---
SELECT "mentorships".* FROM "mentorships"
SELECT "students".* FROM "students"

  def show
    @mentorship = Mentorship.find(params[:id])
    @students = Student.all
---
SELECT "mentorships".* FROM "mentorships" WHERE "mentorships"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "students".* FROM "students"

  def create
    @mentorship = Mentorship.new(params[:mentorship])

    respond_to do |format|
      if @mentorship.save
---
INSERT INTO "mentorships" ("created_at", "mentor_id", "student_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Dec 2013 22:59:45 UTC +00:00], ["mentor_id", 2], ["student_id", 1], ["updated_at", Mon, 02 Dec 2013 22:59:45 UTC +00:00]]