app/controllers/mentorships_controller.rb

SELECT "mentors".* FROM "mentors" WHERE "mentors"."active" = 't'
---
  def index
    @mentorships = Mentorship.all
    @mentors = Mentor.where(:active => true)