app/controllers/mentors_controller.rb

  def index
    @mentors = Mentor.where(:active => true)
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."active" = 't'

  def show
    @mentor = Mentor.find(params[:id])
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @mentor = Mentor.find(params[:id])
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @mentor = Mentor.new(params[:mentor])

    respond_to do |format|
      if @mentor.save
---
INSERT INTO "mentors" ("active", "capacity", "created_at", "name", "profile", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @mentor = Mentor.find(params[:id])

    respond_to do |format|
      if @mentor.update_attributes(params[:mentor])
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "mentors" SET "active" = 'f', "updated_at" = '2013-12-02 20:11:45.750612' WHERE "mentors"."id" = 14

  def destroy
    @mentor = Mentor.find(params[:id])
    @mentor.destroy
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "mentors" WHERE "mentors"."id" = ?  [["id", 1]]