app/controllers/reviews_controller.rb

  def set_mentor
    @mentor = Mentor.find(params[:mentor_id])
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT 1  [["id", "1"]]