app/controllers/students_controller.rb

	def index
		if current_user.student
	    @user = user
	    @cf_class = @user.cf_class
	    @mentors = Mentor.joins(:user).where("approval = 1 AND cf_class = ?", @cf_class).order(:id)
	    @mentor = @user.mentor
      @rankings = current_user.student.studentrankings.order(:rank)
	    @companies = []
	    @mentors.each do |mentor|
---
SELECT "mentors".* FROM "mentors" WHERE "mentors"."user_id" = 1 LIMIT 1