app/controllers/students_controller.rb

INSERT INTO "students" ("camp_id", "created_at", "name", "profile", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["camp_id", 2], ["created_at", Sun, 01 Dec 2013 19:34:24 UTC +00:00], ["name", "Henry"], ["profile", "Link"], ["updated_at", Sun, 01 Dec 2013 19:34:24 UTC +00:00], ["user_id", nil]]
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save